TITLE Lab3

IDEAL
MODEL SMALL
STACK 512

MACRO cont
dec si  		;si = si - 1
add bx, 10h     ;bx = bx + 16
jcxz lpe        ;Якщо cx == 0, то стрибаємо на мітку lpe
dec cx			;cx = cx - 1
ENDM cont

DATASEG
array db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '
	  db ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '

CODESEG
Start:
mov ax, @data
mov ds, ax			;ініціалізуємо дата-сегмент

mov si, 0Fh			;задаємо початкове значення si = 15 
mov bx, 3 * 10h     ;задаємо початкове значення bx = 48
mov cx, 10h - 3		;задаємо початкове значення cx = 13


lp:
	mov [array + si + bx], 'S'	;array[bx/16][si] = 'S'
	cont						;макрос для зміни індексів (по діагоналі з правого верхнього до нижнього лівого)
	mov [array + si + bx], 'D'
	cont
	mov [array + si + bx], 'I'
	cont
	mov [array + si + bx], 'S'
	cont
	mov [array + si + bx], 'D'
	cont
	mov [array + si + bx], 'I'
	cont
	mov [array + si + bx], 'H'
	cont
	mov [array + si + bx], 'O'
	cont
	mov [array + si + bx], 'S'
	dec si
	add bx, 10h
	loop lp 					; Якщо cx != 0, то стрибаємо на мітку lp і cx = cx - 1
lpe:
	
mov ah, 4ch
mov al, 0
int 21h			;Вихід з програми з кодом 0
end Start
